rottenpotatoes/app/controllers/movies_controller.rb

SELECT * FROM "movies"
---
  def index
    @movies = Movie.all

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
---
  def show
    @movie = Movie.find(params[:id])

SELECT * FROM "movies" WHERE ("movies"."id" = 3)
---
  def edit
    @movie = Movie.find(params[:id])

INSERT INTO "movies" ("rating", "created_at", "title", "overview", "released_on", "scores", "updated_at", "genre", "description") VALUES(NULL, '2010-10-18 22:26:28', 'hi', NULL, NULL, NULL, '2010-10-18 22:26:28', NULL, NULL)
---
  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
DELETE FROM "movies" WHERE "id" = 1
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy